# Preprocessing 1

KETERANGAN KOLOM:
1. Customer_ID = Nomor Customer
2. Name = Nama Pelanggan
3. Age = Umur
4. Gender = Jenis Kelamin
5. Join_Date = Tanggal Bergabung
6. Last_Purchase = Tanggal Belanja Terakhir
7. Total_Spend = Total Duit Yang Dihabiskan
8. Country = Negara Asal
9. Email = Alamat Email
10. Notes = Catatan Tambahan

### A.1 Import Libraries

In [307]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

### A.2 Load Data

In [308]:
try:
    df = pd.read_csv('dataset_preprocessing_raw.csv')
    print("Berhasil Membaca Data")
except Exception as e:
    print("Gagal Membaca Data")

Berhasil Membaca Data

### A.3 Cek Dimensi Data

In [309]:
df.shape

(10, 10)

In [310]:
df.head()

,customer_id,name,age,gender,join_date,last_purchase,total_spend,country,email,notes
0,1,Siti A,17,F,2021/13/01,2024-02-30,150000,Indonesa,sitiA@examplecom,loyal customer
1,2,BUDI,-,Male,2020-05-10,2023-11-15,250.000,Indonesia,budi@@mail.com,NaN
2,3,Agus,200,M,2019-07-21,2024-01-12,1.200.000,indo,agus@mail.com,sering complaint
3,4,Wati wati,25,female,2020/08/01,NaN,-50000,Singapore,wati@mail,pembayaran bermasalah
4,5,Andi,NaN,M,2022-12-01,2023-14-01,"350,000",Indonesia,andi@@mail.com,NaN

In [311]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    10 non-null     int64
 1   name           10 non-null     object
 2   age            9 non-null      object
 3   gender         10 non-null     object
 4   join_date      10 non-null     object
 5   last_purchase  8 non-null      object
 6   total_spend    9 non-null      object
 7   country        10 non-null     object
 8   email          10 non-null     object
 9   notes          8 non-null      object
dtypes: int64(1), object(9)
memory usage: 932.0+ bytes

### A.4 Nilai Duplikasi

In [312]:
df.duplicated().sum()

np.int64(0)

### A.5 Nilai Hilang

In [313]:
df.isna().sum()

customer_id      0
name             0
age              1
gender           0
join_date        0
last_purchase    2
total_spend      1
country          0
email            0
notes            2
dtype: int64

### A.6 Encoding Format Teks

In [314]:
df['name'] = df['name'].str.title()

In [315]:
df['name'] = df['name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)

In [316]:
df['name']

0        Siti A
1          Budi
2          Agus
3     Wati Wati
4          Andi
5    Maya Putri
6          Dede
7          Joko
8          Lina
9          Rina
Name: name, dtype: object

In [317]:
df['email'] = df['email'].str.lower()

In [318]:
df['email'] = df['email'].str.replace('@@', '@')

In [319]:
df['email'] = df['email'].str.replace('examplecom', 'example.com')

In [320]:
df['email'] = df['email'].str.replace('mail_com', 'mail.com')

In [321]:
missing_com = df['email'].str.endswith('@mail')

df.loc[missing_com, 'email'] = df['email'] + '.com'

In [322]:
df['email']

0      sitia@example.com
1          budi@mail.com
2          agus@mail.com
3          wati@mail.com
4          andi@mail.com
5    maya.putri@mail.com
6          dede@mail.com
7          joko@mail.com
8          lina@mail.com
9          rina@mail.com
Name: email, dtype: object

In [323]:
df['age'] = df['age'].replace('-', np.nan)

In [324]:
df['age']

0     17
1    NaN
2    200
3     25
4    NaN
5     30
6     22
7     28
8     19
9     24
Name: age, dtype: object

In [325]:
df['gender'] = df['gender'].str.lower()

In [326]:
df['gender'] = df['gender'].str.replace('female', 'F', regex=False)
df['gender'] = df['gender'].str.replace('f', 'F', regex=False)
df['gender'] = df['gender'].str.replace('male', 'M', regex=False)
df['gender'] = df['gender'].str.replace('m', 'M', regex=False)

In [327]:
df['gender'] = df['gender'].str.replace('?', 'M')

In [328]:
df['gender']

0    F
1    M
2    M
3    F
4    M
5    F
6    M
7    M
8    F
9    F
Name: gender, dtype: object

### A.7 Encoding Format Tanggal

In [329]:
df['join_date'] = df['join_date'].str.replace(r"[/.]", "-", regex=True)

In [330]:
df['join_date'] = df['join_date'].str.replace('202x-02-01', '2022-02-01')

In [331]:
df['join_date'] = df['join_date'].str.replace('2021-13-01', '2022-01-01')

In [332]:
df['join_date'] = pd.to_datetime(df['join_date'])

In [333]:
df['join_date']

0   2022-01-01
1   2020-05-10
2   2019-07-21
3   2020-08-01
4   2022-12-01
5   2023-01-05
6   2022-02-01
7   2021-04-10
8   2020-02-29
9   2023-03-01
Name: join_date, dtype: datetime64[ns]

In [334]:
df['last_purchase'] = df['last_purchase'].str.replace('2024-02-30', '2024-03-01')

In [335]:
df['last_purchase'] = df['last_purchase'].str.replace('2023-14-01', '2024-02-01')

In [336]:
df['last_purchase'] = df['last_purchase'].fillna('2024-01-01')

In [337]:
df['last_purchase']

0    2024-03-01
1    2023-11-15
2    2024-01-12
3    2024-01-01
4    2024-02-01
5    2023-12-10
6    2023-10-05
7    2023-06-18
8    2023-09-12
9    2024-01-01
Name: last_purchase, dtype: object

In [338]:
df['last_purchase'] = pd.to_datetime(df['last_purchase'])

### A.7 Encoding Format Numerik

In [339]:
df['age'] = pd.to_numeric(df['age'])

In [340]:
age_median = df['age'].median()

In [341]:
df['age'] = df['age'].fillna(age_median)

In [342]:
df['age']

0     17.0
1     24.5
2    200.0
3     25.0
4     24.5
5     30.0
6     22.0
7     28.0
8     19.0
9     24.0
Name: age, dtype: float64

In [343]:
df['total_spend'] = df['total_spend'].astype(str).str.replace(r'[.,]', '', regex=True)

In [344]:
df['total_spend'] = pd.to_numeric(df['total_spend'] , errors='coerce')

In [345]:
df.loc[df['total_spend'] < 0, 'total_spend'] = np.nan

In [346]:
median_spend = df['total_spend'].median()

df['total_spend'] = df['total_spend'].fillna(median_spend)

In [347]:
df['total_spend']

0     150000.0
1     250000.0
2    1200000.0
3     375000.0
4     350000.0
5     750000.0
6     375000.0
7     900000.0
8          0.0
9     400000.0
Name: total_spend, dtype: float64

### A.8 Deteksi Outliers

In [348]:
q1 = df[['age', 'total_spend']].quantile(0.25)
q3 = df[['age', 'total_spend']].quantile(0.75)

q1, q3

(age                22.5
 total_spend    275000.0
 Name: 0.25, dtype: float64,
 age                27.25
 total_spend    662500.00
 Name: 0.75, dtype: float64)

In [349]:
iqr = q3 - q1
iqr

age                 4.75
total_spend    387500.00
dtype: float64

In [350]:
lb = q1 - 1.5 * iqr
ub = q3 + 1.5 * iqr
lb, ub

(age                15.375
 total_spend   -306250.000
 dtype: float64,
 age                 34.375
 total_spend    1243750.000
 dtype: float64)

In [351]:
df[(df['age'] < lb['age']) | (df['age'] > ub['age'])]

,customer_id,name,age,gender,join_date,last_purchase,total_spend,country,email,notes
2,3,Agus,200.0,M,2019-07-21,2024-01-12,1200000.0,indo,agus@mail.com,sering complaint

In [352]:
df['age'] = df['age'].replace(200, age_median)

In [353]:
df['age']

0    17.0
1    24.5
2    24.5
3    25.0
4    24.5
5    30.0
6    22.0
7    28.0
8    19.0
9    24.0
Name: age, dtype: float64

In [354]:
df[(df['total_spend'] < lb['total_spend']) | (df['total_spend'] > ub['total_spend'])]

Empty DataFrame
Columns: [customer_id, name, age, gender, join_date, last_purchase, total_spend, country, email, notes]
Index: []

### A.9 Encoding Feature

In [355]:
df

,customer_id,name,age,gender,join_date,last_purchase,total_spend,country,email,notes
0,1,Siti A,17.0,F,2022-01-01,2024-03-01,150000.0,Indonesa,sitia@example.com,loyal customer
1,2,Budi,24.5,M,2020-05-10,2023-11-15,250000.0,Indonesia,budi@mail.com,NaN
2,3,Agus,24.5,M,2019-07-21,2024-01-12,1200000.0,indo,agus@mail.com,sering complaint
3,4,Wati Wati,25.0,F,2020-08-01,2024-01-01,375000.0,Singapore,wati@mail.com,pembayaran bermasalah
4,5,Andi,24.5,M,2022-12-01,2024-02-01,350000.0,Indonesia,andi@mail.com,NaN
5,6,Maya Putri,30.0,F,2023-01-05,2023-12-10,750000.0,Indonesia,maya.putri@mail.com,sering beli produk premium
6,7,Dede,22.0,M,2022-02-01,2023-10-05,375000.0,Malaysia,dede@mail.com,customer baru
7,8,Joko,28.0,M,2021-04-10,2023-06-18,900000.0,indonesia,joko@mail.com,karakter khusus di nama
8,9,Lina,19.0,F,2020-02-29,2023-09-12,0.0,Indonesia,lina@mail.com,tanggal join invalid
9,10,Rina,24.0,F,2023-03-01,2024-01-01,400000.0,Indon,rina@mail.com,email tidak lengkap

In [358]:
df['country'].unique()

array(['Indonesa', 'Indonesia', 'indo', 'Singapore', 'Malaysia',
       'indonesia', 'Indon'], dtype=object)

In [357]:
df['country'] = df['country'].str.replace('Indon, Indonesa', 'Indonesia')